Revit 2027 API
Space.WallReflectance Property
Get or set the Wall Reflectance of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double WallReflectance { get; set; }
Public Property WallReflectance As Double
	Get
	Set
public:
property double WallReflectance {
	double get ();
	void set (double value);
}
member WallReflectance : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Wall Reflectance of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace